app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new
    # raise params.inspect
    if params[:artist_id] && !Artist.exists?(params[:artist_id])

SELECT "artists".* FROM "artists"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 6]]
---
  def edit
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to artists_path, alert: "Artist not found."
    else
      if params[:id] && Song.exists?(params[:id])
        @song = Song.find(params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "songs" SET "title" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Where is My Mind??"], ["updated_at", "2017-09-19 20:04:31.059382"], ["id", 6]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)